### Viewing Processed Datasets

In [2]:
import pandas as pd

ff3 = pd.read_parquet("../data/processed/ff3_monthly.parquet")
mom = pd.read_parquet("../data/processed/mom_monthly.parquet")
factors = pd.read_parquet("../data/processed/factors_monthly.parquet")
rets = pd.read_parquet("../data/processed/returns_monthly.parquet")

display(ff3.head())
display(factors.describe())
display(rets.tail())
display(mom.head())

        date  Mkt-RF   SMB   HML    RF
0 1926-07-01    2.89 -2.55 -2.39  0.22
1 1926-08-01    2.64 -1.14  3.81  0.25
2 1926-09-01    0.38 -1.36  0.05  0.23
3 1926-10-01   -3.27 -0.14  0.82  0.32
4 1926-11-01    2.54 -0.11 -0.61  0.31

,date,Mkt-RF,SMB,HML,RF,Mom
count,1187,1187.000000,1187.000000,1187.000000,1187.000000,1187.000000
mean,1976-05-31 20:45:53.833192928,0.006893,0.001708,0.003459,0.002700,0.006103
min,1927-01-01 00:00:00,-0.287400,-0.174100,-0.138300,-0.000600,-0.526100
25%,1951-09-16 00:00:00,-0.020050,-0.016300,-0.014400,0.000300,-0.009650
50%,1976-06-01 00:00:00,0.010800,0.000700,0.001400,0.002300,0.007900
75%,2001-02-15 00:00:00,0.036600,0.017400,0.017600,0.004200,0.029400
max,2025-11-01 00:00:00,0.388100,0.359600,0.355200,0.013500,0.180200
std,NaN,0.053205,0.031597,0.035623,0.002496,0.046831

                     date       ret
1188  1751328000000000000  0.015098
1189  1754006400000000000  0.064359
1190  1756684800000000000  0.018610
1191  1759276800000000000  0.007542
1192  1761955200000000000  0.022598

        date   Mom
0 1927-01-01  0.57
1 1927-02-01 -1.50
2 1927-03-01  3.52
3 1927-04-01  4.36
4 1927-05-01  2.78